results/results_2/test.02.rate4.30sec/output.txt
[Tue Aug 11 01:46:47 PM UTC 2026] Waiting for http://e-disaggregation-epp:80/v1/models ...
  Endpoint up.

[Tue Aug 11 01:46:47 PM UTC 2026] === Rate 4 (seed=57424) ===
/usr/local/lib/python3.12/dist-packages/torchao/quantization/quant_api.py:1731: SyntaxWarning: invalid escape sequence '\.'
  """Configuration class for applying different quantization configs to modules or parameters based on their fully qualified names (FQNs).
/sgl-workspace/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] The `use_fast` parameter is deprecated and will be removed in a future version. Use `backend="torchvision"` instead of `use_fast=True`, or `backend="pil"` instead of `use_fast=False`.
/sgl-workspace/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (1920x1080) with 480 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='e-disaggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-2B-Instruct', served_model_name=None, tokenizer=None, num_prompts=120, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=4.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=57424, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true, "skip_special_tokens": false}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://e-disaggregation-epp:80/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url=None, host='e-disaggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-2B-Instruct', served_model_name=None, tokenizer=None, num_prompts=120, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=4.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=57424, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true, "skip_special_tokens": false}', apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 997237
#Output tokens: 15360
#Total images: 480
#Images per request: 4 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=128.0, total=15360
  Text prompt tokens (with chat template): avg=142.3, total=17077
  Text prompt overhead: avg=14.3, total=1717
  Vision tokens: avg=8168.0, total=980160

Created 120 random jpeg images with average 8359269 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 120/120 [00:57<00:00,  2.09it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    4.0       
Max request concurrency:                 not set   
Successful requests:                     120       
Benchmark duration (s):                  57.29     
Total input tokens:                      997237    
Total input text tokens:                 17077     
Total input vision tokens:               980160    
Total generated tokens:                  15360     
Total generated tokens (retokenized):    15360     
Request throughput (req/s):              2.09      
Input token throughput (tok/s):          17406.57  
Output token throughput (tok/s):         268.11    
Peak output token throughput (tok/s):    357.00    
Peak concurrent requests:                55        
Total token throughput (tok/s):          17674.68  
Concurrency:                             28.67     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   13685.73  
Median E2E Latency (ms):                 13413.97  
P90 E2E Latency (ms):                    21775.83  
P95 E2E Latency (ms):                    23535.33  
P99 E2E Latency (ms):                    24415.95  
---------------Time to First Token----------------
Mean TTFT (ms):                          13433.00  
Median TTFT (ms):                        13158.29  
P90 TTFT (ms):                           21534.94  
P95 TTFT (ms):                           23294.08  
P99 TTFT (ms):                           24169.99  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          1.99      
Median TPOT (ms):                        1.90      
P90 TPOT (ms):                           1.98      
P95 TPOT (ms):                           2.42      
P99 TPOT (ms):                           3.55      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           2.24      
Median ITL (ms):                         1.89      
P90 ITL (ms):                            2.66      
P95 ITL (ms):                            3.97      
P99 ITL (ms):                            11.55     
Max ITL (ms):                            169.17    
==================================================
[Tue Aug 11 01:49:04 PM UTC 2026] Rate 4 done.
[Tue Aug 11 01:49:04 PM UTC 2026] All rates complete.